config.org
#+TITLE: Doom Emacs Config
#+AUTHOR: Chris Cochrun
#+PROPERTY: header-args :tangle config.el
#+DESCRIPTION: This is my literate emacs config

* Start of File
Welcome to my doom emacs config. I'm using literate programming because it allows me to more cleanly edit each piece without individual files and allowing me to describe better what each block of code does.

#+BEGIN_SRC elisp
;;; config.el -*- lexical-binding: t; -*-
(setq user-full-name "Chris Cochrun"
      user-mail-address "chris@tfcconnection.org")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

(setq doom-font (font-spec :family "VictorMono Nerd Font" :size 12.0 :weight 'semi-bold)
      doom-variable-pitch-font (font-spec :family "Noto Sans" :size 13.0 :weight 'semi-bold))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-snazzy)
(setq doom-themes-treemacs-theme "doom-colors")

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type 'relative)


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c g k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c g d') to jump to their definition and see how
;; they are implemented.



;; MY CHANGES
;; Author: Chris Cochrun
;; Email: chris@tfcconnection.org

(setq-default delete-by-moving-to-trash t
              tab-width 4)

;; QT/QML
;; Ensure qml is added to the completion engine company
(add-to-list 'company-backends 'company-qml)

(setq company-qml-extra-qmltypes-files '("/home/chris/.Felgo/Felgo/gcc_64/import/VPlayPlugins/vplayplugins.qmltypes"
                                         "/home/chris/.Felgo/Felgo/gcc_64/import/VPlayApps/vplayapps.qmltypes"
                                         "/home/chris/.Felgo/Felgo/gcc_64/import/VPlay/vplay.qmltypes"
                                         "/home/chris/.Felgo/Felgo/gcc_64/import/Felgo/felgo.qmltypes"
                                         "/home/chris/.Felgo/Felgo/gcc_64/qml"))

;; gdscript
(require 'gdscript-mode)

#+END_SRC
* Doom Modeline

Doom's modeline is great, but with just a bit of tweaking, it's even better.
#+BEGIN_SRC elisp
(setq
 all-the-icons-scale-factor 0.8
 doom-modeline-height 30
 doom-modeline-major-mode-icon t
 doom-modeline-major-mode-color-icon t
 doom-modeline-mu4e t
 doom-modeline-bar-width 3)
#+END_SRC

LF UTF-8 is the default file encoding. So it's not worth showing in the modeline when it is the files encoding. Let's hide it unless it's different from LF UTF-8.
#+BEGIN_SRC elisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+END_SRC

* EXWM
:PROPERTIES:
:header-args: :tangle no
:END:

Through the power of Org-Mode we can turn this off and on depending on if the next time Emacs is launched I want it to be my window manager.

When using exwm, the loading process looks nicer if we set it to launch fullscreen at first.
#+BEGIN_SRC elisp
(set-frame-parameter nil 'fullscreen 'fullboth)
#+END_SRC

Also, we need a way to display the time.
#+BEGIN_SRC elisp
(display-time-mode t)
(setq display-time-interval 10)
(setq display-time-format "%a %b %e, %l:%M %p")
#+END_SRC

#+BEGIN_SRC elisp
(require 'exwm)
(require 'exwm-config)
(exwm-config-default)
(require 'exwm-randr)
(setq exwm-randr-workspace-monitor-plist '(0 "DVI-D-0" 1 "HDMI-0"))
(add-hook! 'exwm-randr-screen-change-hook
  (lambda ()
    (start-process-shell-command
     "xrandr" nil "xrandr --output DVI-D-0 --primary --mode 1920x1080 --pos 0x0 --rotate normal --output HDMI-0 --mode 1600x900 --pos 1920x0 --rotate normal")))
(exwm-randr-enable)
(require 'exwm-systemtray)
(exwm-systemtray-enable)
(setq exwm-systemtray-height 18)
(setq exwm-systemtray-icon-gap 6)
(setq exwm-workspace-number 8)
(setq exwm-workspace-show-all-buffers t)

(defun exwm-workspace-next ()
  "Move forward one workspace."
  (interactive)
  (if (< exwm-workspace-current-index (1- exwm-workspace-number))
      (exwm-workspace-switch (1+ exwm-workspace-current-index))
    (message "No next workspace.")))

(defun exwm-workspace-prev ()
  "Move to the previous workspace."
  (interactive)
  (if (> exwm-workspace-current-index 0)
      (exwm-workspace-switch (1- exwm-workspace-current-index))
    (message "No previous workspace.")))

(defun exwm-flameshot ()
  "Take a screenshot using flameshot"
  (interactive)
  (shell-command "flameshot gui"))

(defun exwm-rofi ()
  "use rofi to launch programs"
  (interactive)
  (shell-command "/home/chris/.dotfiles/rofi/launchers-git/launcher.sh"))

;;Global keybindings
(setq exwm-input-global-keys
          `(
            ;; 's-r': Reset (to line-mode).
            ([?\s-r] . exwm-reset)
            ;; 's-w': Switch workspace.
            ([?\s-w] . exwm-workspace-switch)
            ([?\s-j] . exwm-workspace-prev)
            ([?\s-k] . exwm-workspace-next)
            ;; Switch Buffer
            ([?\s-b] . +ivy/switch-buffer)
            ([?\s-m] . exwm-workspace-move-window)
            ;; close app
            ([?\s-c] . kill-this-buffer)
            ;; screenshot
            ([print] . exwm-flameshot)
            ;; 's-&': Launch application.
            ([?\s-r] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))
            ([menu] . counsel-linux-app)
            ;; 's-N': Switch to certain workspace.
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))

(setq exwm-floating-border-width 0)
(setq exwm-manage-configurations '(((or (string-match-p "libreoffice"
                                                   exwm-class-name)
                                   (string= exwm-class-name "MuseScore3")
                                   (string= exwm-class-name "Gimp")
                                   (string= exwm-class-name "mpv")
                                   (string= exwm-title "Event Tester"))
                               floating t
                               floating-mode-line nil
                               )))


(start-process-shell-command "xset" nil "xset r rate 220 90")
(start-process-shell-command "fehwall" nil "feh --bg-fill ~/Pictures/wallpapers/RoyalKing.png")
(start-process-shell-command "picom" nil "picom")
(start-process-shell-command "flameshot" nil "flameshot")
(start-process-shell-command "nextcloud" nil "nextcloud")
(start-process-shell-command "caffeine" nil "caffeine")
(start-process-shell-command "kdeconnect-indicator" nil "kdeconnect-indicator")

#+END_SRC

Make sure that Ivy's posframe loads above exwm windows
#+BEGIN_SRC elisp
(setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
(defun +ivy-posframe-display-exwm (str)
  (ivy-posframe--display str
   (lambda (info)
     (let* ((workarea (elt exwm-workspace--workareas exwm-workspace-current-index))
            (x (aref workarea 0))
            (y (aref workarea 1))

            (fw (aref workarea 2))
            (fh (aref workarea 3))

            (pw (plist-get info :posframe-width))
            (ph (plist-get info :posframe-height)))

       (cons (+ x (/ (- fw pw) 2)) (+ y (/ (- fh ph) 2)))))))

(setq ivy-posframe-display-functions-alist
      '((t . +ivy-posframe-display-exwm))

      ivy-posframe-parameters '((parent-frame nil)
                                (z-group . above)))

;; force set frame-position on every posframe display
(advice-add 'posframe--set-frame-position :before
            (lambda (&rest args)
              (setq-local posframe--last-posframe-pixel-position nil)))
#+END_SRC

